package letterrec;


/**
 *
 */
public class NeuralNetworkService {

    //TODO: Данный класс использовать как набор методов. Для нейронной сети создать отдельный класс
    //TODO: Реализовать алгоритм обучения нейронной сети Розенблата
    //TODO: Реализовать алгоритм распознования символа
    //TODO: Реализовать алгоритм определения границы нарисованного символа
    //TODO: Реализовать алгоритм растягивания символа на всю заданную сетку
    //TODO: Реализовать алгоритм самообучения сети на основе эталонного изображения
}
